# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8-pose keypoints/pose estimation model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/pose

# Parameters
nc: 1 # number of classes
kpt_shape: [17, 3] # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolov8n-pose.yaml' will call yolov8-pose.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3k2, [256, False,0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 1, DilationAttentionModule, [256]]
  - [-1, 6, C3k2, [512, False,0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 6, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 1, DilationAttentionModule, [1024]]
  - [-1, 3, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 11
  - [-1, 2, C2PSA, [1024]] #12

# YOLOv11.0n head
head:
  - [ 5, 1, Conv, [ 256, 3, 4 ] ]
  - [ [ -1, 12], 1, Concat, [ 1 ] ] # cat head P5
  - [ -1, 3, C3k2, [ 1024, False] ] # 15 (P5/32-large)

  - [ -1, 1, DySample, [ 2, "lp" ] ]
  - [ [ -1, 7 ], 1, Concat, [ 1 ] ] # cat backbone P4
  - [ -1, 3, C3k2, [ 512, False ] ] # 18

  - [ -1, 1,DySample, [ 2, "lp" ] ]
  - [ 12, 1, nn.Upsample, [ None, 4, "nearest" ]]
  - [ [ -1, 5, 19], 1, Concat, [ 1 ] ] # cat backbone P3
  - [ -1, 3, C3k2, [ 256, False ] ] # 22 (P3/8-small)

  - [ -1, 1, Conv, [ 256, 3, 2 ] ]
  - [ [ -1, 7, 18 ], 1, Concat, [ 1 ] ] # cat head P4
  - [ -1, 3, C3k2, [ 512, False ] ] # 25 (P4/16-medium)

  - [ -1, 1, Conv, [ 512, 3, 2 ] ]
  - [ [ -1, 12, 15], 1, Concat, [ 1 ] ] # cat head P5
  - [ -1, 3, C3k2, [ 1024, False] ] # 28 (P5/32-large)

  - [ [ 22, 25, 28 ], 1, Pose, [ nc, kpt_shape ] ] # Pose(P3, P4, P5)












